docs/userguide/documentation/images/LinkerWrapper.d2
...@Common

direction: right

plugin: "Plugin" { class: component }
wrapper: "LinkerWrapper" { class: adapter }
linker: "Linker" { class: component }

plugin -> wrapper -> linker { class: flow }
