docs/userguide/documentation/images/LinkerWrapper.dot
digraph G {
    rankdir="LR";
    node [shape=rectangle]
    A [label="Plugin"]
    B [label="LinkerWrapper"]
    C [label="Linker"]
    A -> B
    B -> C
}
